# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [100]:
import pandas as pd

# Load the cleaned dataframe from the previous lab
url1 = 'cleaned_df.csv'
cleaned_df = pd.read_csv(url1)
cleaned_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,F,Master,793690,0,1000,0,Personal Auto,Four-Door Car,2
1,QZ44356,Arizona,F,Bachelor,697953,0,94,0,Personal Auto,Four-Door Car,1131
2,AI49188,Nevada,F,Bachelor,1288743,48767,108,0,Personal Auto,Two-Door Car,566
3,WW63253,California,M,Bachelor,764586,0,106,0,Corporate Auto,SUV,529
4,GA49547,Washington,M,High School or Below,536307,36357,68,0,Personal Auto,Four-Door Car,17

In [101]:
# Checking data types of each column of cleaned file as a base for cleaning dataframes 2 & 3
cleaned_df.dtypes

customer                     object
state                        object
gender                       object
education                    object
customer_lifetime_value       int64
income                        int64
monthly_premium_auto          int64
number_of_open_complaints     int64
policy_type                  object
vehicle_class                object
total_claim_amount            int64
dtype: object

In [102]:
cleaned_df.nunique()

customer                     1071
state                           5
gender                          2
education                       5
customer_lifetime_value      1028
income                        775
monthly_premium_auto          132
number_of_open_complaints       6
policy_type                     3
vehicle_class                   4
total_claim_amount            495
dtype: int64

In [103]:
# Load the two new dataframes

url2 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv'
url3 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv'

new_df2 = pd.read_csv(url2)
new_df3 = pd.read_csv(url3)

In [104]:
# Overview of 2nd dataframe
new_df2.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.2,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.2,Corporate Auto,Two-Door Car

In [105]:
# Dimensions of dataframe 2
new_df2.shape

(996, 11)

In [106]:
# Standardize the column names of dataframe 2
# Column names should be in lower case
# White spaces in column names should be replaced by _
# st could be replaced for state

new_df2.columns = list(map(lambda x: x.replace(" ", "_").replace(" ", "").replace("ST", "state").lower().strip(), new_df2.columns))
new_df2.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'total_claim_amount', 'policy_type', 'vehicle_class'],
      dtype='object')

In [107]:
# Checking the number of unique values we have in each column of dataframe 2
new_df2.nunique()

customer                     996
state                          6
gender                         4
education                      6
customer_lifetime_value      950
income                       733
monthly_premium_auto         126
number_of_open_complaints      6
total_claim_amount           667
policy_type                    3
vehicle_class                  6
dtype: int64

In [108]:
# Checking the different values we have in the column 'gender', 'state', 'education' & 'vehicle_class'
print(new_df2["state"].value_counts())
print('\n')
print(new_df2["gender"].value_counts())
print('\n')
print(new_df2["education"].value_counts())
print('\n')
print(new_df2["vehicle_class"].value_counts())

state
Oregon        303
California    277
Arizona       142
Nevada        125
Washington    100
AZ             49
Name: count, dtype: int64


gender
F         527
M         461
female      2
Male        1
Name: count, dtype: int64


education
College                 311
High School or Below    290
Bachelor                243
Master                   86
Doctor                   49
Bachelors                17
Name: count, dtype: int64


vehicle_class
Four-Door Car    519
Two-Door Car     211
SUV              174
Sports Car        55
Luxury SUV        21
Luxury Car        16
Name: count, dtype: int64

In [109]:
# Standardizing the columns with consistent values & removing any additional spaces

#state
other_arizona = "AZ"
arizona = "Arizona"
new_df2['state'] = new_df2['state'].replace(other_arizona, arizona)

#gender
new_df2['gender'] = new_df2['gender'].str.strip()
other_female = "female"
female = "F"
other_male = "Male"
male = "M"
new_df2['gender'] = new_df2['gender'].replace(other_female, female)
new_df2['gender'] = new_df2['gender'].replace(other_male, male)

#education
other_bachelor = "Bachelors"
bachelor = "Bachelor"
new_df2['education'] = new_df2['education'].replace(other_bachelor, bachelor)

#vehicle_class
other_luxury = ["Sports Car", "Luxury SUV", "Luxury Car"]
luxury = "Luxury"
new_df2['vehicle_class'] = new_df2['vehicle_class'].replace(other_luxury, luxury)

In [110]:
# Overview of the 3rd dataframe
new_df3.head()

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [111]:
# Dimensions of dataframe 3
new_df3.shape

(7070, 11)

In [112]:
# Standardize the column names of dataframe 3
# Column names should be in lower case
# White spaces in column names should be replaced by _

new_df3.columns = list(map(lambda x: x.replace(" ", "_").replace(" ", "").lower().strip(), new_df3.columns))
new_df3.columns

Index(['customer', 'state', 'customer_lifetime_value', 'education', 'gender',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'total_claim_amount', 'vehicle_class'],
      dtype='object')

In [113]:
# Checking the number of unique values we have in each column of dataframe 3
new_df3.nunique()

customer                     7070
state                           5
customer_lifetime_value      6288
education                       5
gender                          2
income                       4463
monthly_premium_auto          194
number_of_open_complaints       6
policy_type                     3
total_claim_amount           4025
vehicle_class                   6
dtype: int64

In [114]:
# Checking the different values we have in the column 'vehicle_class'
print(new_df3["vehicle_class"].value_counts())

vehicle_class
Four-Door Car    3546
Two-Door Car     1480
SUV              1401
Sports Car        371
Luxury SUV        141
Luxury Car        131
Name: count, dtype: int64

In [115]:
# Standardizing the columns with consistent values

#vehicle_class
new_df3['vehicle_class'] = new_df3['vehicle_class'].replace(other_luxury, luxury)
print(new_df3["vehicle_class"].value_counts())

vehicle_class
Four-Door Car    3546
Two-Door Car     1480
SUV              1401
Luxury            643
Name: count, dtype: int64

In [116]:
# Now let's concatenate the three datasets
# Since we have the same number and names of columns in the 3 datasets,
# we will use vertical concatenation to combine all rows of the 3 datasets

combined_df = pd.concat([cleaned_df, new_df2, new_df3], axis=0)
combined_df.shape

# now we have 9138 rows which is the sum of the number of rows in each dataframe (1072 + 996 + 7070)

(9138, 11)

In [117]:
# for additional cleaning, let's take a look at the datatypes of each column of the combined_df

combined_df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value       object
income                         int64
monthly_premium_auto           int64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [118]:
# Updating the data types of the columns as appropriate

# Changes to make :
# customer_lifetime_value should be numeric & not of object type

# Convert 'customer_lifetime_value' column from object to numeric
combined_df['customer_lifetime_value'] = pd.to_numeric(combined_df['customer_lifetime_value'], errors='coerce')

# Checking again the data types of each column
print("\nData types:")
combined_df.dtypes

Data types:

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                         int64
monthly_premium_auto           int64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [119]:
# number_of_open_complaints has an incorrect format
    # looking at the different values it takes with unique() & take the middle value

combined_df['number_of_open_complaints'].unique()

array([0, 2, 1, 3, 5, 4, '1/0/00', '1/1/00', '1/3/00', '1/5/00', '1/2/00',
       '1/4/00'], dtype=object)

In [120]:
# using split() to deal with the string and take the number needed
combined_df['number_of_open_complaints'] = combined_df['number_of_open_complaints'].astype(str).str.split('/').str[1]

In [121]:
combined_df['number_of_open_complaints'].unique()

array([nan, '0', '1', '3', '5', '2', '4'], dtype=object)

In [122]:
# number_of_open_complaints has an incorrect format
    # casting the column to be numeric

combined_df['number_of_open_complaints'] = pd.to_numeric(combined_df['number_of_open_complaints'], errors='coerce')

# Checking again the data types of each column
print("\nData types:")
combined_df.dtypes

Data types:

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                         int64
monthly_premium_auto           int64
number_of_open_complaints    float64
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [123]:
# Identify any columns with null or missing values of the combined dataframe
combined_df.isna().any()

customer                     False
state                        False
gender                        True
education                    False
customer_lifetime_value       True
income                       False
monthly_premium_auto         False
number_of_open_complaints     True
policy_type                  False
vehicle_class                False
total_claim_amount           False
dtype: bool

In [133]:
# Identify how many null values each column with bool True has

print("Null values in column 'gender':")
combined_df['gender'].isna().sum()

Null values in column 'gender':

5

In [134]:
print("Null values in column 'customer_lifetime_value':")
combined_df['customer_lifetime_value'].isna().sum()

Null values in column 'customer_lifetime_value':

996

In [135]:
print("Null values in column 'number_of_open_complaints':")
combined_df['number_of_open_complaints'].isna().sum()

Null values in column 'number_of_open_complaints':

8142

In [136]:
# Fill the null values with a specific value (mean or median ==> numerical & mode ==> categorical)

# For numerical columns, fill null values with the mean
numerical_cols = combined_df.select_dtypes(include='number').columns
combined_df[numerical_cols] = combined_df[numerical_cols].fillna(combined_df[numerical_cols].mean())

# For categorical columns, fill null values with the mode
categorical_cols = combined_df.select_dtypes(include='object').columns
combined_df[categorical_cols] = combined_df[categorical_cols].fillna(combined_df[categorical_cols].mode().iloc[0])

In [138]:
# Checking again null values in each columns
combined_df.isna().any()

# we can see with the bool 'False' that there are no more columns with null values

customer                     False
state                        False
gender                       False
education                    False
customer_lifetime_value      False
income                       False
monthly_premium_auto         False
number_of_open_complaints    False
policy_type                  False
vehicle_class                False
total_claim_amount           False
dtype: bool

In [139]:
# Convert all the numeric variables to integers
# Let's use the astype() method & then check if all numerical columns have been converted to integers

combined_df[numerical_cols] = combined_df[numerical_cols].astype(int)
combined_df[numerical_cols].dtypes

customer_lifetime_value      int64
income                       int64
monthly_premium_auto         int64
number_of_open_complaints    int64
total_claim_amount           int64
dtype: object

In [140]:
combined_df.shape

(9138, 11)

In [142]:
# Check for duplicate rows in the dataframe

combined_df.duplicated().sum()

# There are no duplicate row
# Combined dataframe is cleaned

0

In [144]:
combined_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,F,Master,793690,0,1000,0,Personal Auto,Four-Door Car,2
1,QZ44356,Arizona,F,Bachelor,697953,0,94,0,Personal Auto,Four-Door Car,1131
2,AI49188,Nevada,F,Bachelor,1288743,48767,108,0,Personal Auto,Two-Door Car,566
3,WW63253,California,M,Bachelor,764586,0,106,0,Corporate Auto,SUV,529
4,GA49547,Washington,M,High School or Below,536307,36357,68,0,Personal Auto,Four-Door Car,17

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [145]:
import pandas as pd

# Load marketing_customer_analysis dataset from an online source
url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv'
marketing_df = pd.read_csv(url)

In [151]:
# Overview of the dataframe
marketing_df.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

In [153]:
# Dimensions of the dataframe
marketing_df.shape

(10910, 27)

In [156]:
marketing_df.nunique()

unnamed:_0                       10910
customer                          9134
state                                5
customer_lifetime_value           8041
response                             2
coverage                             3
education                            5
effective_to_date                   59
employmentstatus                     5
gender                               2
income                            5694
location_code                        3
marital_status                       3
monthly_premium_auto               202
months_since_last_claim             37
months_since_policy_inception      100
number_of_open_complaints            7
number_of_policies                   9
policy_type                          3
policy                               9
renew_offer_type                     4
sales_channel                        4
total_claim_amount                5106
vehicle_class                        6
vehicle_size                         3
vehicle_type                         1
month                                2
dtype: int64

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [162]:
# Pivot the DataFrame to see the total revenue for each sales channel
pivot_df = marketing_df.pivot_table(index='sales_channel', values=['total_claim_amount'], aggfunc='sum')
pivot_df

               total_claim_amount
sales_channel
Agent                1.810227e+06
Branch               1.301204e+06
Call Center          9.266008e+05
Web                  7.066000e+05

In [163]:
# Round the total revenue to 2 decimal points
pivot_df['total_claim_amount'] = pivot_df['total_claim_amount'].round(2)
pivot_df

# 'Agent' & 'Branch' sales channel brought the most sales in terms of total revenue

               total_claim_amount
sales_channel
Agent                  1810226.82
Branch                 1301204.00
Call Center             926600.82
Web                     706600.04

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [171]:
marketing_df.pivot_table(index=['gender','education'], values=['customer_lifetime_value'], aggfunc='mean').round(2)

                             customer_lifetime_value
gender education
F      Bachelor                              7874.27
       College                               7748.82
       Doctor                                7328.51
       High School or Below                  8675.22
       Master                                8157.05
M      Bachelor                              7703.60
       College                               8052.46
       Doctor                                7415.33
       High School or Below                  8149.69
       Master                                8168.83

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [179]:
# Create a pivot table with the number of open complaints by policy type & month
pivot_table = pd.pivot_table(marketing_df, values='number_of_open_complaints', index=['month'], columns=['policy_type'], aggfunc='count', fill_value=0)

display(pivot_table)

policy_type  Corporate Auto  Personal Auto  Special Auto
month
1                      1252           4329           237
2                      1089           3799           204

In [180]:
# Stack the pivot table to show it in a long format table
pivot_table.stack().reset_index()

   month     policy_type     0
0      1  Corporate Auto  1252
1      1   Personal Auto  4329
2      1    Special Auto   237
3      2  Corporate Auto  1089
4      2   Personal Auto  3799
5      2    Special Auto   204